app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "username", "phone", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
		def create
      @user = User.new(user_params)
      @user.image = params[:user][:images]
		  if (params[:user][:age] == "")
         @user.age = params[:age]
      else
        @user.age = params[:user][:age]
      end
        @user.save